require('plugins')
require('util')

local g = vim.g

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Telescope                                                                  │
-- ╚────────────────────────────────────────────────────────────────────────────│

local telescope = require('telescope')

local extensions = { 'file_browser', 'fzf' }

for _, extension in ipairs(extensions) do
  telescope.load_extension(extension)
end

local dropdown = {
  theme = 'dropdown',
  previewer = false,
  layout_config = { height = 0.5, width = 0.8 },
}

local ivy = {
  theme = 'ivy',
  previewer = false,
  border = false,
  layout_config = { height = 10 },
}

telescope.setup({
  defaults = {
    prompt_prefix = ' ',
  },
  pickers = {
    buffers = dropdown,
    file_browser = ivy,
    find_files = dropdown,
    git_files = dropdown,
    lsp_references = ivy,
  },
  extensions = {
    fzf = {
      fuzzy = true,
      override_generic_sorter = true,
      override_file_sorter = true,
      case_mode = 'smart_case',
    },
  },
})

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Treesitter                                                                 │
-- ╚────────────────────────────────────────────────────────────────────────────│

require('nvim-treesitter.configs').setup({
  ensure_installed = {
    'go',
    'java',
    'javascript',
    'latex',
    'lua',
    'ocaml',
    'python',
    'rust',
    'tsx',
    'typescript',
    'zig',
  },

  highlight = {
    enable = true,
  },

  incremental_selection = {
    enable = true,
    keymaps = {
      init_selection = '<cr>',
      node_incremental = 'grn',
      scope_incremental = 'grc',
      node_decremental = 'grm',
    },
  },

  playground = {
    enable = true,
    disable = {},
    updatetime = 25,
    persist_queries = false,
    keybindings = {
      toggle_query_editor = 'o',
      toggle_hl_groups = 'i',
      toggle_injected_languages = 't',
      toggle_anonymous_nodes = 'a',
      toggle_language_display = 'I',
      focus_language = 'f',
      unfocus_language = 'F',
      update = 'R',
      goto_node = '<cr>',
      show_help = '?',
    },
  },
})

-- Setup just TS parser
require('tree-sitter-just').setup({})

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Bufferline                                                                 │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.bufferline = {
  animation = false,
  auto_hide = false,
  tabpages = true,
  closable = true,
  clickable = true,
  icons = true,
  icon_separator_active = '',
  icon_separator_inactive = '',
  icon_close_tab = '',
  icon_close_tab_modified = '●',
  icon_pinned = '車',
  maximum_padding = 1,
  maximum_length = 30,
  semantic_letters = true,
  letters = 'asdfjkl;ghnmxcvbziowerutyqpASDFJKLGHNMXCVBZIOWERUTYQP',
  no_name_title = nil,
}

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Startify                                                                   │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.startify_custom_header = {
  '                                                            ',
  '                                                            ',
  '                                                            ',
  '                                        ░░                  ',
  '      ███████   █████   ██████  ██    ██ ██ ██████████      ',
  '     ░░██░░░██ ██░░░██ ██░░░░██░██   ░██░██░░██░░██░░██     ',
  '      ░██  ░██░███████░██   ░██░░██ ░██ ░██ ░██ ░██ ░██     ',
  '      ░██  ░██░██░░░░ ░██   ░██ ░░████  ░██ ░██ ░██ ░██     ',
  '      ███  ░██░░██████░░██████   ░░██   ░██ ███ ░██ ░██     ',
  '     ░░░   ░░  ░░░░░░  ░░░░░░     ░░    ░░ ░░░  ░░  ░░      ',
  '                                                            ',
  '                                                            ',
}

g.startify_bookmarks = {
  { v = '~/dotfiles/config/nvim/init.lua' },
  { a = '~/dotfiles/.aliases' },
  { f = '~/dotfiles/.functions' },
}

g.startify_commands = {
  { ch = { 'Health Check', ':checkhealth' } },
  { ps = { 'Plugin sync', ':PackerSync' } },
  { pu = { 'Update neovim plugins', ':PackerUpdate' } },
  { h = { 'Help', ':help' } },
}

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Rustfmt                                                                    │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.rustfmt_autosave = 0

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Markdown Composer                                                          │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.markdown_composer_autostart = 0
g.markdown_composer_syntax_theme = 'dark'
g.markdown_folding = 0
g.vim_markdown_auto_insert_bullets = 0
g.vim_markdown_conceal = 0
g.vim_markdown_conceal_code_blocks = 0
g.vim_markdown_new_list_item_indent = 0

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Autopairs                                                                  │
-- ╚────────────────────────────────────────────────────────────────────────────│

require('nvim-autopairs').setup()

local npairs = require('nvim-autopairs')

_G.MUtils = {}

MUtils.completion_confirm = function()
  if vim.fn.pumvisible() ~= 0 then
    return npairs.esc('<cr>')
  else
    return npairs.autopairs_cr()
  end
end

map(
  'i',
  '<CR>',
  'v:lua.MUtils.completion_confirm()',
  { expr = true, noremap = true }
)

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Netrw                                                                      │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.netrw_altv = 1
g.netrw_banner = 0
g.netrw_browse_split = 4
g.netrw_liststyle = 3
g.netrw_winsize = 20

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ LSP                                                                        │
-- ╚────────────────────────────────────────────────────────────────────────────│

local lsp = require('lspconfig')

local on_attach = function(client)
  map('n', '<leader>=', '<cmd>lua vim.lsp.buf.formatting()<CR>')
  map('n', '<leader>ar', '<cmd>lua vim.lsp.buf.rename()<CR>')
  map('n', 'K', '<cmd>lua vim.lsp.buf.hover()<CR>')
  map('n', 'gd', '<cmd>lua vim.lsp.buf.definition()<CR>')
  map('n', 'gi', '<cmd>lua vim.lsp.buf.implementation()<CR>')
  map('n', 'gr', '<cmd>lua vim.lsp.buf.references()<CR>')
end

local servers = {
  'gopls',
  'ocamllsp',
  'pyright',
  'rust_analyzer',
  'zls',
}

for _, server in ipairs(servers) do
  lsp[server].setup({
    on_attach = on_attach,
    settings = {
      [server] = {
        diagnostics = { disabled = { 'inactive-code' } },
      },
    },
  })
end

local configs = require('lspconfig.configs')

if not configs.just_lsp then
  configs.just_lsp = {
    default_config = {
      cmd = { '/Users/liam/src/just-lsp/bin/start' },
      filetypes = { 'just' },
      root_dir = function(name)
        return lsp.util.find_git_ancestor(name)
      end,
      settings = {},
    },
  }
end

lsp.just_lsp.setup({})

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Lualine                                                                    │
-- ╚────────────────────────────────────────────────────────────────────────────│

require('lualine').setup({
  options = {
    icons_enabled = true,
    lower = true,
    theme = 'ayu_mirage',
  },
  sections = {
    lualine_a = { 'mode' },
    lualine_b = { 'branch', 'filename', 'diff' },
    lualine_c = { 'lsp_progress' },
  },
})

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Ultisnips                                                                  │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.UltiSnipsExpandTrigger = '<tab>'
g.UltiSnipsJumpBackwardTrigger = '<c-z>'
g.UltiSnipsJumpForwardTrigger = '<c-b>'

-- ───────────────────────────────────────────────────────────────────────────-─╗
-- │ Vimtex                                                                     │
-- ╚────────────────────────────────────────────────────────────────────────────│

g.tex_conceal = 'abdmg'
g.tex_flavor = 'latex'
g.vimtex_compiler_method = 'latexmk'
g.vimtex_quickfix_mode = 0
g.vimtex_view_method = 'zathura'
