tap "bios-marcel/cordless"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "rhysd/tweet-app", "https://github.com/rhysd/tweet-app"
tap "tlk/imagemagick-x11"
tap "yudai/gotty"
tap "zegervdv/zathura"

# Interpreted, interactive, object-oriented programming language
brew "python@3.9"

# Core application library for C
brew "glib"

# Generate introspection data for GObject libraries
brew "gobject-introspection"

# OpenType text shaping engine
brew "harfbuzz"

# Framework for layout and rendering of i18n text
brew "pango"

# Icons for the GNOME project
brew "adwaita-icon-theme"

# Record and share terminal sessions
brew "asciinema"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Glorious Glasgow Haskell Compilation System
brew "ghc"

# Command-line interface for Cabal and Hackage
brew "cabal-install"

# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"

# Cross-platform make
brew "cmake"

# C implementation of Markdown
brew "discount"

# Create Docker hosts locally and on cloud providers
brew "docker-machine", restart_service: true

# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"

# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true

# GNU Emacs text editor
brew "emacs", restart_service: true

# Calculator REPL, similar to bc(1)
brew "eva"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Command-line fuzzy finder written in Go
brew "fzf"

# GNU awk utility
brew "gawk"

# GNU compiler collection
brew "gcc"

# GitHub command-line tool
brew "gh"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Powerful, lightweight programming language
brew "lua"

# Command-driven, interactive function plotting
brew "gnuplot"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"

# Command-line hex viewer
brew "hexyl"

# Haskell source code suggestions
brew "hlint"

# Improved top (interactive process viewer)
brew "htop"

# Configurable static site generator
brew "hugo"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Handy way to save and run project-specific commands
brew "just"

# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"

# Interpreted, interactive, object-oriented programming language
brew "python@3.8"

# Library that provides automatic proxy configuration management
brew "libproxy"

# Next-gen compiler infrastructure
brew "llvm"

# Small build system for use with gyp or CMake
brew "ninja"

# Fast and user friendly build system
brew "meson"

# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"

# Open source relational database management system
brew "mysql", restart_service: true

# Open source relational database management system
brew "mysql@5.7"

# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"

# Fast, highly customisable system info script
brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true

# Platform built on V8 to build network applications
brew "node", link: false

# OCaml package manager
brew "opam"

# Formatter for Haskell source code
brew "ormolu"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Cross-platform application and UI framework
brew "qt"

# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"

# Object-relational database system
brew "postgresql", restart_service: true

# Object-relational database system
brew "postgresql@12", restart_service: true

# Static type checker for Python
brew "pyright"

# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Autoformat shell script source code
brew "shfmt"

# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"

# Cross-shell prompt for astronauts
brew "starship"

# Programmatically correct mistyped console commands
brew "thefuck"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Maintained ctags implementation
brew "universal-ctags"

# Google's JavaScript engine
brew "v8"

# Vi 'workalike' with many additional features
brew "vim"

# Internet file retriever
brew "wget"

# Show the current WiFi network password
brew "wifi-password"

# Allow GNU Readline to be used with arbitrary programs
brew "with-readline"

# JavaScript package manager
brew "yarn"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"

# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"

# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell", link: false

# Static checker for GitHub Actions workflow files
brew "rhysd/actionlint/actionlint"

# Tools and libraries to manipulate images in many formats (X11 support)
brew "tlk/imagemagick-x11/imagemagick"

brew "yudai/gotty/gotty"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"

# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"

# Application launcher and productivity software
cask "alfred"

# E-books management software
cask "calibre"

# App to build and share containerized applications and microservices
cask "docker"

# Matrix collaboration client
cask "element"

cask "font-caskaydia-cove-nerd-font"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Interface for reading and syncing eBooks
cask "kindle"

# Full TeX Live distribution with GUI applications
cask "mactex"

# App to write, plan, collaborate, and get organized
cask "notion"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"

# Development environment
cask "vagrant"

# Virtualizer for x86 hardware
cask "virtualbox"

# Open-source code editor
cask "visual-studio-code"

# Open-source version of the X.Org X Window System
cask "xquartz"

# Collect, organize, cite, and share research sources
cask "zotero"
