tap "bios-marcel/cordless"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "yudai/gotty"
tap "zegervdv/zathura"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"

# Command-line interface for SQLite
brew "sqlite"

# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false

# Core application library for C
brew "glib"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"

# Cross-platform make
brew "cmake"

# Calculator REPL, similar to bc(1)
brew "eva"

# Command-line fuzzy finder written in Go
brew "fzf"

# GNU awk utility
brew "gawk"

# GNU compiler collection
brew "gcc"

# Glorious Glasgow Haskell Compilation System
brew "ghc"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Improved top (interactive process viewer)
brew "htop"

# Configurable static site generator
brew "hugo"

# Interpreted, interactive, object-oriented programming language
brew "python@3.8"

# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Next-gen compiler infrastructure
brew "llvm"

# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"

# Open source relational database management system
brew "mysql"

# Open source relational database management system
brew "mysql@5.7"

# Fast, highly customisable system info script
brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"

# Platform built on V8 to build network applications
brew "node", link: false

# Swiss-army knife of markup format conversion
brew "pandoc"

# Object-relational database system
brew "postgresql"

# Object-relational database system
brew "postgresql@12"

# Persistent key-value database, with built-in net interface
brew "redis"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Cross-shell prompt for astronauts
brew "starship"

# Programmatically correct mistyped console commands
brew "thefuck"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Validating, recursive, caching DNS resolver
brew "unbound"

# Google's JavaScript engine
brew "v8"

# Vi 'workalike' with many additional features
brew "vim"

# Internet file retriever
brew "wget"

# Show the current WiFi network password
brew "wifi-password"

# JavaScript package manager
brew "yarn"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"

# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell", link: false

brew "yudai/gotty/gotty"

brew "zegervdv/zathura/zathura"

brew "zegervdv/zathura/zathura-pdf-poppler"

# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"

# Application launcher and productivity software
cask "alfred"

# E-books management software
cask "calibre"

# App to build and share containerized applications and microservices
cask "docker"

cask "intellij-idea"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

# Interface for reading and syncing eBooks
cask "kindle"

# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"

# App to write, plan, collaborate, and get organized
cask "notion"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"

# Open-source code editor
cask "visual-studio-code"

# Collect, organize, cite, and share research sources
cask "zotero"
