alfred
android-sdk
bitcoin-core
blackhole-2ch
calibre
docker
dotnet-sdk
element
font-caskaydia-cove-nerd-font
iterm2
kindle
mactex
netnewswire
notion
obsidian
rectangle
vagrant
virtualbox
visual-studio-code
xquartz
zotero
