{
  "barbar.nvim": { "branch": "master" },
  "cmp-nvim-lsp": { "branch": "main" },
  "copilot-cmp": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "git-messenger.vim": { "branch": "master" },
  "janet.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lspkind.nvim": { "branch": "master" },
  "lualine-lsp-progress": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "playground": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "snacks.nvim": { "branch": "main" },
  "telescope-file-browser.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tiny-code-action.nvim": { "branch": "main" },
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
  "typst-preview.nvim": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-glsl": { "branch": "master" },
  "vim-just": { "branch": "main" },
  "vim-markdown": { "branch": "master" },
  "vim-rooter": { "branch": "master" },
  "vim-startify": { "branch": "master" },
  "vim-toml": { "branch": "main" }
}
